Revit 2024 API
gbXMLSpaceType Enumeration
 This enumeration corresponds to the spaceType attribute in gbXML. The enumerated attribute identifies the type of space defined and allows to better approximate the actual internal loads and schedules associated with the defined space type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum gbXMLSpaceType
Visual Basic
Public Enumeration gbXMLSpaceType
Visual C++
public enum class gbXMLSpaceType
Members
Member name | Description
CustomizeSpaceType
NoSpaceType
ActiveStorage
ActiveStorageHospitalOrHealthcare
AirOrTrainOrBusBaggageArea
AirportConcourse
AtriumEachAdditionalFloor
AtriumFirstThreeFloors
AudienceOrSeatingAreaPenitentiary
AudienceOrSeatingAreaExerciseCenter
AudienceOrSeatingAreaGymnasium
AudienceOrSeatingAreaSportsArena
AudienceOrSeatingAreaConventionCenter
AudienceOrSeatingAreaMotionPictureTheatre
AudienceOrSeatingAreaPerformingArtsTheatre
AudienceOrSeatingAreaReligious
AudienceOrSeatingAreaPoliceOrFireStations
AudienceOrSeatingAreaCourtHouse
AudienceOrSeatingAreaAuditorium
BankCustomerArea
BankingActivityAreaOffice
BarberAndBeautyParlor
CardFileAndCataloguingLibrary
ClassroomOrLectureOrTrainingPenitentiary
ClassroomOrLectureOrTraining
ConfinementCellsPenitentiary
ConfinementCellsCourtHouse
ConferenceMeetingOrMultipurpose
CorridorOrTransition
CorridorOrTransitionManufacturingFacility
CorridorsWithPatientWaitingExamHospitalOrHealthcare
CourtSportsAreaSportsArena
CourtroomCourtHouse
DepartmentStoreSalesAreaRetail
DetailedManufacturingFacility
DiningArea
DiningAreaHotel
DiningAreaFamilyDining
DiningAreaLoungeOrLeisureDining
DiningAreaMotel
DiningAreaTransportation
DiningAreaPenitentiary
DiningAreaCivilServices
DormitoryBedroom
DormitoryStudyHall
DressingOrLockerOrFittingRoomGymnasium
DressingOrLockerOrFittingRoomCourtHouse
DressingOrLockerOrFittingRoomPerformingArtsTheatre
DressingOrLockerOrFittingRoomAuditorium
DressingOrLockerOrFittingRoomExerciseCenter
ElectricalOrMechanical
ElevatorLobbies
EmergencyHospitalOrHealthcare
EquipmentRoomManufacturingFacility
ExamOrTreatmentHospitalOrHealthcare
ExerciseAreaExerciseCenter
ExerciseAreaGymnasium
ExhibitSpaceConventionCenter
FellowshipHallReligiousBuildings
FineMaterialWarehouse
FineMerchandiseSalesAreaRetail
FireStationEngineRoomPoliceOrFireStation
FoodPreparation
GarageServiceOrRepairAutomotiveFacility
GeneralHighBayManufacturingFacility
GeneralLowBayManufacturingFacility
GeneralExhibitionMuseum
HospitalNurseryHospitalOrHealthcare
HospitalOrMedicalSuppliesHospitalOrHealthcare
HospitalOrRadiologyHospitalOrHealthcare
HotelOrConferenceCenterConferenceOrMeeting
InactiveStorage
JudgesChambersCourtHouse
LaboratoryOffice
LaundryIroningAndSorting
LaundryWashingHospitalOrHealthcare
LibraryAudioVisualLibraryAudioVisual
LivingQuartersDormitory
LivingQuartersMotel
LivingQuartersHotel
Lobby
LobbyReligiousBuildings
LobbyMotionPictureTheatre
LobbyAuditorium
LobbyPerformingArtsTheatre
LobbyPostOffice
LobbyHotel
LoungeOrRecreation
MallConcourseSalesAreaRetail
MassMerchandisingSalesAreaRetail
MediumOrBulkyMaterialWarehouse
MerchandisingSalesAreaRetail
MuseumAndGalleryStorage
NurseStationHospitalOrHealthcare
OfficeEnclosed
OfficeOpenPlan
OfficeCommonActivityAreasInactiveStorage
OperatingRoomHospitalOrHealthcare
OtherTelevisedPlayingAreaSportsArena
ParkingAreaAttendantOnlyParkingGarage
ParkingAreaPedestrianParkingGarage
PatientRoomHospitalOrHealthcare
PersonalServicesSalesAreaRetail
PharmacyHospitalOrHealthcare
PhysicalTherapyHospitalOrHealthcare
PlayingAreaGymnasium
Plenum
PoliceStationLaboratoryPoliceOrFireStations
PublicAndStaffLoungeHospitalOrHealthcare
ReadingAreaLibrary
ReceptionOrWaitingTransportation
ReceptionOrWaitingMotel
ReceptionOrWaitingHotel
RecoveryHospitalOrHealthcare
RestorationMuseum
Restrooms
RingSportsAreaSportsArena
SleepingQuartersPoliceOrFireStation
SortingAreaPostOffice
SpecialtyStoreSalesAreaRetail
StacksLibrary
StairsInactive
Stairway
SupermarketSalesAreaRetail
TerminalTicketCounterTransportation
WorkshopWorkshop
WorshipPulpitChoirReligious
NoOfSpaceTypes
See Also
Autodesk.Revit.DB.Analysis Namespace